OpenFOAMObject/meshParticle/haukur_case_class_solver/ergoCyl/constant/cylPorousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cylPorousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    CD
    {
        radialAngle 0;         
        rotationAngle 45;

        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (1000 5e7 1000);
           // f   f [0 -1 0 0 0 0 0] (0 0 0);
        }
    }
)

// ************************************************************************* //
